practice-for-ch-rails-music-app-long-practice-main/music_app/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "Peter.l.nolan@gmail.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-11-29 21:26:03.045140"], ["updated_at", "2023-11-29 21:26:03.045140"]]